app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("address", "age", "created_at", "email", "mobile_no", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)